name: "grid_based_crop"
backend: "python"
max_batch_size: 4
input [
{
    name: "original"
    data_type: TYPE_UINT8
    dims: [-1, -1, -1]
}
]

output [
{
    name: "cropped_images"
    data_type: TYPE_FP32
    dims: [-1, 3, -1, -1]
},
{
    name: "snippets"
    data_type: TYPE_UINT8
    dims: [-1, 3, -1, -1]
}
]

instance_group [{ kind: KIND_GPU }]
dynamic_batching { }
