name: "clip_preprocess"
backend: "dali"
max_batch_size: 256
input [
{
    name: "image"
    data_type: TYPE_UINT8
    dims: [-1]
}
]

output [
{
    name: "preprocessed"
    data_type: TYPE_FP32
    dims: [3, 224, 224]
}
]

instance_group [{ kind: KIND_GPU }]
dynamic_batching { }
